In [3]:
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv('V5.csv')
df.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,?,Detached House,3,2,1092.0,1.025953,East

How many unknown ("?) values are present in the dataset? Remove/Delete unknown ("?) values present in the dataset to make it null value.
Remove/Delete - means it will show NAN in place of "?"

In [5]:
unknown_count=(df=='?').sum()
unknown_count

Date                    0
Year                    0
Locality                0
Estimated Value         0
Sale Price              0
Property             1823
Residential             0
num_rooms               0
num_bathrooms           0
carpet_area             0
property_tax_rate       0
Face                    0
dtype: int64

In [6]:
# Replace all "?" with NaN
df.replace('?', np.nan, inplace=True)
df.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,NaN,Detached House,3,2,1092.0,1.025953,East

In [7]:
df.shape

(10000, 12)

What is the value present at the 692th indexed row and 0th indexed column in the data

In [6]:
df.iloc[692,0]

'2009-11-16'

What is the value present at the 546th indexed row and 7th indexed column in the data

In [7]:
df.iloc[546,7]

3

What are the unique values present in the Locality feature of the dataset?

In [8]:
df['Locality'].unique()

array(['Waterbury', 'Bridgeport', 'Greenwich', 'Norwalk', nan,
       'Fairfield', 'West Hartford', 'Stamford'], dtype=object)

Which of the following features have missing(NaN) values present in the dataset?

In [8]:
df.isnull().sum()

Date                    0
Year                    0
Locality             1253
Estimated Value      1243
Sale Price              0
Property             1823
Residential             0
num_rooms               0
num_bathrooms           0
carpet_area          1229
property_tax_rate       0
Face                    0
dtype: int64

Which of the following feature has most missing(NaN) values present in the dataset?

In [10]:
df.isnull().sum()

Date                    0
Year                    0
Locality             1253
Estimated Value      1243
Sale Price              0
Property             1823
Residential             0
num_rooms               0
num_bathrooms           0
carpet_area          1229
property_tax_rate       0
Face                    0
dtype: int64


Drop all the samples(rows) with missing values strictly greater than 2. How many samples remains after that

Therefore, dropna(thresh=df.shape[1] - 2) will drop rows from the DataFrame df if they have fewer than (df.shape[1] - 2) non-null values. In other words, it retains rows that have at least two non-null values.

For example, if a row has 12 columns and it has at least 10 non-null values, it will be retained. If a row has fewer than 10 non-null values, it will be dropped.

In [11]:
df_copy=df.copy()
df_cleaned = df_copy.dropna(thresh=df.shape[1] - 2)
df_cleaned.shape

(9917, 12)

Drop all the samples(rows) with missing values in the original dataframe . How many samples remains after that ?

In [10]:
x=df.dropna()
x.shape

(5449, 12)

GA-1.2


Select all the even indexed rows from the given dataset. What is the value in the 3rd indexed column of the 0th indexed row in the selected dataframe. (row/ column indexed from zero(0) in python/pandas)

In [13]:
even_rows=df.iloc[::2]
even_rows.iloc[0,3]

111440.0

Select all the even indexed rows from the given dataset. What is the value in the 3rd indexed column of the 332th indexed row in the selected dataframe. (row/ column indexed from zero(0))

In [14]:
even_rows.iloc[332,3]

256200.0

Select all the odd indexed rows from the given dataset. What is the value in the 3rd indexed column of the 332th indexed row in the selected dataframe. (row/ column indexed from zero(0))

In [15]:
odd_rows=df.iloc[1::2]
odd_rows.iloc[332,3]

352940.0

Select all the odd indexed columns from the given dataset. What is the value in the 5th indexed column of the 100th indexed row in the selected dataframe. (row/ column indexed from zero(0))

In [28]:
odd_col=df.iloc[:,1::2]
odd_col.iloc[100,5]

'West'

Select all the even indexed columns and even indexed rows from the given dataset. What is the value in the 3th indexed column of the 255th indexed row in the selected dataframe. (row/ column indexed/starts from zero(0))

In [13]:
even_col=df.iloc[::2,::2]
even_col.iloc[255,3]

'Detached House'

Determine the number of samples (rows) in the dataset that belong to the six most recent years, based on the provided data.

In [18]:
x=(df.Year>2016)
x.sum()

4749

In [19]:
# Assuming the 'Year' column contains the information about the years
# Convert the 'Year' column to datetime format
df['Year'] = pd.to_datetime(df['Year'], format='%Y')

# Sort the DataFrame based on the 'Year' column in descending order
df_sorted = df.sort_values(by='Year', ascending=False)

# Extract the six most recent years
recent_years = df_sorted['Year'].unique()[:6]

# Filter the DataFrame to include only rows from the six most recent years
recent_years_data = df[df['Year'].isin(recent_years)]

# Get the number of samples in the filtered DataFrame
num_samples_recent_years = recent_years_data.shape[0]

print(f'Number of samples in the six most recent years: {num_samples_recent_years}')

Number of samples in the six most recent years: 4749

Determine the number of samples (rows) in the dataset which has num_rooms = 3 and num_bathrooms = 3

In [20]:
num=(df.num_rooms==3)&(df.num_bathrooms==3)
num.sum()

2730


Determine the number of samples (rows) in the dataset which has num_rooms = 3 or num_bathrooms = 3

In [21]:
num1=(df.num_rooms==3)|(df.num_bathrooms==3)
num1.sum()

8591

In the Year 2022, how many houses (rows) located in the Greenwich Locality have exactly num_room == 3, and facing towards either the North or East

In [41]:
condition=((df.Year=='2022')&(df.Locality=='Greenwich')&(df.num_rooms==3)&(df.Face.isin(['North','East'])))
condition.sum()

42


Calculate the number of samples(rows) that correspond to the month of August across all the years.?

In [23]:
# Assuming the 'Date' column is in datetime format
df['Date'] = pd.to_datetime(df['Date'])

# Filter rows corresponding to the month of August
august_data = df['Date'].dt.month == 8
august_data.sum()

1050

In [24]:
df.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009-01-01,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009-01-01,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
2,2009-01-02,2009-01-01,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
3,2009-01-02,2009-01-01,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
4,2009-01-02,2009-01-01,Bridgeport,112351.0,210000.0,NaN,Detached House,3,2,1092.0,1.025953,East

According to the data which Locality have highest average Sale Price

In [16]:
avg_sales=df.groupby('Locality')['Sale Price'].mean()
avg_sales.idxmax()

'Greenwich'